# for i in range(5):

# for i in 'String':
#     print (i, end=' ')
#     print (1, end=' ')

# n = 10
# # while True:
# while n > 0:
#     print(1)
#     n -= 1

# n = 10
# while n > 0:
#     if n % 2 == 0:
#         n -= 1
#         continue
#     elif n == 5:
#         break
#     print (n, end="   ")
#     n -= 3




#     Beginner level

# 1. Виведіть повідомлення Hello, Python! на екран n разів (n - ціле число, яке вводить користувач).

# n = int(input('Enter numbe:  '))

# for i in range(n):
#     print ('Hello, Python!')

# ------------------------------------------------------------------------------------------------

# 2. Дано два цілих числа a і b (a ≤ b). Виведіть всі числа від a до b включно.

# a = int(input('Enter numbe1:  '))
# b = int(input('Enter numbe:  '))

# for i in range(a, b+1):
#     print (i)

# ---------------------------------------------------------------------------------------------

# 3. Напишіть програму-таймер зворотного відліку, яка запитує у користувача кількість секунд n, з якої слід починати відлік.

# n = int(input('Enter second:  '))

# for i in range(n, 0, -1):
#    print (i)

# print ('Start!')

#-----------------------------------------------------------------------------------------------

# 4. Користувач вводить кількість навчальних предметів n, а потім, відповідно, оцінки учня з n навчальних предметів. Визначте середню оцінку.

# n = int(input("Enter the number of subjects: "))

# grades = []

# for i in range(n):
#     grade = float(input(f"Enter grade for the subject {i+1}: "))
#     grades.append(grade)

# average = sum(grades) / n

# print(f"Average rating: {average:.2f}")

# ------------------------------------------------------------------------------------------------

# 5. Надрукувати у рядку m разів число n. Числа m і n - цілі числа, які вводить користувач у порядку n, m.

# n = int(input('Enter numbe1:  '))
# m = int(input('Enter numbe:  '))

# for i in range (m):
#       print(n, end=' ')

# --------------------------------------------------------------------------------------------------

# 6. Напишіть програму для друку цілих чисел від n до 0 із виведенням біля кожного числа кількості символів #, що дорівнює значенню числа.

# n = int(input('Enter numbe:  '))

# for i in range(n, 0, -1):
#     print (str(i)+ " " + "#"*i)

# --------------------------------------------------------------------------------------------------

# 7. Напишіть програму для побудови шаблону як у вихідних даних за введеним значенням n.

# n = int(input('Enter number:  '))

# for i in range (1, n+1):
#     print(str(i) * i)

# --------------------------------------------------------------------------------------------------

# Middle level

# 8. Намалювати сходинки як у вихідних даних, використовуючи символи пропуску і решітки #, коли на вхід програми подається ціле число n - кількість сходинок.

# n = int(input('Enter number:  '))

# for i in range (1, n+1):
#     print("#" * i)

# -------------------------------------------------------------------------------------------------------------------------

# 9. За даним цілим додатнім числом n обчисліть n! - значення факторіалу цього числа.

# n = int(input("Enter number: "))

# factorial = 1

# for i in range(1, n + 1):
#     factorial *= i

# print(f"The factorial of {n} is {factorial}")

# ----------------------------------------------------------------------------------------------------------------------------

# 10. Автогонщик в перший день ралі проїхав d км. Кожен наступний день він збільшував пробіг на 10% від пробігу попереднього дня. Через скільки днів автоспортивних змагань сумарний пробіг автомобіля за всі дні перевищить t км і яке значення сумарного пробігу? Введення даних користувачем відбувається в порядку: d, t.

# d = int(input("On the first day of the rally, the race car driver drove, km: "))
# t = int(input("Enter total mileage, km: "))

# sum_distance = d   
# days = 1

# while sum_distance <= t:
    
#     d *=  1.1
#     sum_distance += d  
#     days += 1

# print(f"In {days} days, the total mileage will exceed {t} km")
# print(f"The total mileage will be {sum_distance:.2f} km")
      
# -------------------------------------------------------------------------------------------------------------------------------

# 11. Дано ціле число n. З чисел 1, 4, 9, 16, 25, …​ надрукувати ті, які не перевищують n. (зверніть увагу на задану послідовність)

# n = int(input("Enter number: "))

# i = 1

# while i**2 <= n:
#     print(i**2, end=" ")
#     i += 1

# ----------------------------------------------------------------------------------------------------------------------------------

# 12. Дано цілі числа a і b. Обчислити a ^ b (a в степені b), не використовуючи операцію піднесення до степеня.

# a = int(input("Enter number: "))
# b = int(input("Enter number: "))

# res = 1
# i = 0

# while i < b:
#     res *= a
#     i += 1
# print(res)

# ----------------------------------------------------------------------------------------------------------------------------------

# Hard level

# 13. Дано натуральне число n. Визначити, чи є воно автоморфним числом.
# Примітка: Автоморфне число - число, квадрат якого рівний останнім розрядами квадрата цього числа: 5 - 25, 6 - 36, 25 - 625.

# n = int(input("Enter number: "))

# square = n ** 2
# digits = len(str(n))
# last_digits = square % (10 ** digits)

# if last_digits == n:
#     print(True)
# else:
#     print(False)

# ----------------------------------------------------------------------------------------------------------------------------------

# 14. Дано натуральне число n. Надрукуйте всі n-значні непарні натуральні числа в порядку спадання.

# n = int(input("Enter number: "))

# max_n = 10 ** n - 1     
# min_n = 10 ** (n - 1)

# for i in range (max_n, min_n - 1, -1):
#    if  i % 2 != 0:
#      print (i, end=' ')

# ----------------------------------------------------------------------------------------------------------------------------------

# 15. Написати програму для обчислення суми цифр цілого числа n. Програма має враховувати, що на вхід може подаватися ціле від’ємне число.

# n = input("Enter number: ")

# len_n = len(n)
# sum = 0

# if n[0] == "-":
#     sum -= int(n[1])
#     start = 2
# else:
#     start = 0

# for i in range(start, len(n)):
#         sum += int(n[i])
   
# print(sum)

# ----------------------------------------------------------------------------------------------------------------------------------

# 16. Напишіть програму для отримання рядка Фібоначчі від 0 до n, де n - ціле число.
# Послідовність Фібоначчі - це серія чисел 0, 1, 1, 2, 3, 5, 8, 13, 21, .... Кожне наступне число знайдено шляхом додавання двох номерів перед ним.

# n = int(input("Enter number: "))

# a, b = 0, 1  

# while a <= n:
#     print(a, end=" ")
#     a, b = b, a + b

# ----------------------------------------------------------------------------------------------------------------------------------

# 17. За введеним користувачем цілим числом n визначте n-е число Фібоначчі.
# тобто, яке саме число у рядку Фібоначчі знаходиться під індексом n

n = int(input("Enter number: "))

a, b = 0, 1  

if n == 0:
    print(0)
elif n == 1:
    print(1)
else:
    for i in range(2, n + 1):
        a, b = b, a + b
    print(b)
