# Створіть консольну програму «Помічник користувача», яка містить меню з трьох пунктів і об’єднує всі теми, вивчені на попередніх заняттях.

# При запуску програма має виводити:

# === Помічник користувача ===

# Перевірити пароль
# Обчислити середній бал
# Перевірити слово на паліндром
# Вийти
# Користувач обирає номер пункту, вводить необхідні дані, і програма виконує відповідну дію. Робота програми триває, поки користувач не обере пункт “4. Вийти”.


# Опис пунктів меню

# Перевірка пароля
# Користувач вводить пароль. Програма перевіряє, чи відповідає він вимогам:

# не менше 8 символів;

# містить велику та маленьку літеру;

# містить цифру;

# не має пробілів.

# Якщо всі умови виконані — вивести:

# Пароль надійний

# Інакше — повідомити, які саме умови порушено.

# Калькулятор середнього балу
# Користувач вводить оцінки через кому (наприклад: 12, 10, 9, 11). Програма:

# перетворює їх у числа,

# перевіряє, що всі оцінки від 1 до 12,

# обчислює середнє арифметичне,

# виводить середній бал та оцінку за шкалою:

# Середній бал Коментар 10–12 Відмінно! 7–9 Добре 4–6 Задовільно 1–3 Спробуйте ще 

# 3. Перевірка слова на паліндром

# Користувач вводить слово. Програма:

# виводить його у зворотному порядку,

# підраховує кількість голосних і приголосних,

# визначає, чи є слово паліндромом (читається однаково зліва направо і справа наліво).

# Вимоги до програми

# Кожен пункт меню реалізувати у вигляді окремої функції.

# Головне меню має працювати у нескінченному циклі while.

# Використати умовні оператори, цикли, рядкові методи та арифметичні обчислення.

# Код має бути охайним, читабельним і містити коментарі.

# Приклад роботи програми === Помічник користувача ===

# Перевірити пароль
# Обчислити середній бал
# Перевірити слово на паліндром
# Вийти
# Оберіть пункт меню: 1 Введіть пароль: Python123 Пароль надійний

# Оберіть пункт меню: 2 Введіть оцінки через кому: 12,10,11 Середній бал: 11.0 Відмінно!

# Оберіть пункт меню: 3 Введіть слово: level Перевернуте слово: level Голосних: 2 Приголосних: 3 Це паліндром

# Оберіть пункт меню: 4 До побачення!

# Додаткове (за бажанням)

# Додайте підрахунок кількості виконаних дій за сесію.

# Збережіть результати у файл results.txt.

# Додайте опцію "5. Очистити екран".

# print ("=== Помічник користувача ===")
# print()

# p1 = print("1. Перевірити пароль")
# p2 = print("2. Обчислити середній бал")
# p3 = print("3. Перевірити слово на паліндром")
# p4 = print("4. Вийти")

# print()
# p = int(input("Оберіть пункт меню: "))

# while p > 0 and p < 4:
    
#     if p  == 1:

#         password = input("Enter Passwor: ")

#     if len(password) < 8:
#            print ("Пароль має містити не менше 8 символів")
#            break

#     for letter in password:
#          if letter.isupper():
#               break
#     print("Пароль має містити велику літеру")    
             
#     for i in password:
#         if i.isdigit(): 
#              nas_number = True
#         else:
#              print("Пароль має містити цифру")

#     for j in password:
#          if j == " ":
#               print("Пароль не має містити пробіли")

 
# print("Password is secure!")


# elif p == 2:
# 2. Калькулятор середнього балу
# Користувач вводить оцінки через кому (наприклад: 12, 10, 9, 11). Програма:

# перетворює їх у числа,

# перевіряє, що всі оцінки від 1 до 12,

# обчислює середнє арифметичне,

# виводить середній бал та оцінку за шкалою:
# Середній бал Коментар 10–12 Відмінно! 7–9 Добре 4–6 Задовільно 1–3 Спробуйте ще


# elif p == 3:

# 3. Перевірка слова на паліндром

# Користувач вводить слово. Програма:

# виводить його у зворотному порядку,

# підраховує кількість голосних і приголосних,

# визначає, чи є слово паліндромом (читається однаково зліва направо і справа наліво).

# else:
#     print("Ви вийшли з програми. До побачення!")
