
# print ('dHfeIufh'.lower())
# print ('dhfeiufh'.upper())
# print ('dhfeiufh'.isdigit())

# s = 'qwerty'
# print (s[-1])
# print (s[1:3])
# print (s[:3])
# print (s[2:])
# print (s[::-1])
# # print (s[2:5:-1])  
# print (s[5:2:-1])


# name = "Alisa"
# print (f'Hello, {name}! How are you?')



# Напишіть програму, яка приймає від користувача рядок, і відображає цей рядок у верхньому і нижньому регістрах.

# s = input ('Enter text: ')
# print (s.lower())
# print (s.upper())

# Скласти програму, яка запитує назву баскетбольної команди і повторює її на екрані зі словами: This is a champion!.

# name = input ('Enter name basketball team: ')
# print(f'{name}! This is a champion!')

# Дано натуральне число. Знайти число, що отримується при прочитанні його цифр справа наліво.

# number = int(input('Enter number: '))
# print (str(number)[::-1])

# Дано рядок. Змініть регістр символів в цьому рядку так, щоб перша буква кожного слова була великою, а інші літери - малими. (метод s.title

# s = input ('Enter text: ')
# print(s.title())

# Дано рядок. Визначити порядковий номер першої вказаної букви. Якщо такої літери немає, вивести нуль.

# text = input ('Enter text: ')
# letter = input ('Enter latter: ')

# if letter in text:
#     position = text.index(letter) + 1  
#     print("Serial number of the first letter:", position)
# else:
#     print(0)



# Напишіть програму, яка по введеному числу n від 1 до 9 виводить на екран n пінгвінів з відповідним номером - число від 1 до n. Зображення одного пінгвіна має розмір 5 x 9 символів, між двома сусідніми пінгвінами також є порожній (з пропусків) стовпець. Дозволяється вивести порожній стовпець після останнього пінгвіна. Для спрощення малювання скопіюйте пінгвіна із вихідних даних. Врахуйте, що виведення на екран виконується порядково, а не «попінгвінно».

n = int(input('Enter number (1-9):  '))

p1 = "    _~_    " 
p2 = "   (o o)   "
p3 = "  /  V  \\  " 
p5 = "   ^^ ^^   " 

print(p1 * n)
print(p2 * n)
print(p3 * n)

nums = "1 2 3 4 5 6 7 8 9"[:2*n]

# p4 = " /(  "  +  "  )\\  /(  ".join(nums.split()) +  "  )\\  "
# print(p4)

for i in range(1, n+1):
    print (f" /(  {i}  )\\ ", end='')


print('\n' + p5 * n)

# У рядку є кілька слів, розділених одним або декількома пропусками. Потрібно прибрати з тексту зайві пропуски: два і більше пропусків поспіль, а також всі пропуски на початку і в кінці рядка. На вхід програмі подається рядок, що складається не більше ніж з 255 символів. Надрукувати новий рядок.

# text = "    Beyond the green     swelling hills of the     Mittel Land rose mighty slopes of forest    up    to the lofty steeps of the Carpathians    themselves"

# clean = " ".join(text.split())
# print(clean)

# Дано рядок, що складається з n цифр (тобто одноцифрових чисел), між якими стоїть n-1 знаків операцій, кожна з яких може бути або +, або -. Обчисліть значення цього виразу. Програма має надрукувати результат обчислення цього виразу.

# r = '5-3+1'

# Вхідні дані:
# 5-3+1
# 6+3-2
# Вихідні дані:
# 3
# 7

# Напишіть програму, на вхід якої даються чотири числа a, b, c і d, кожне у своєму рядку. Програма повинна вивести фрагмент таблиці множення для всіх чисел відрізка [a; b] на всі числа відрізка [c; d]. Числа a, b, c і d є натуральними і не перевищують 10, a ≤ b, c ≤ d. Дотримуйтесь формату виведення як у вихідних даних. Для поділу елементів всередині рядка використовуйте \t - символ табуляції. Зауважте, що лівим стовпчиком і верхнім рядком виводяться самі числа із заданих відрізків.
# Вхідні дані:
# 1
# 4
# 2
# 5
# Вихідні дані:
# 	2	3	4	5
# 1	2	3	4	5
# 2	4	6	8	10
# 3	6	9	12	15
# 4	8	12	16	20

# Напишіть програму для друку літери A за допомогою введеного користувачем символа.
#  Вхідні дані: 
#  * 
#  Вихідні дані: 
#    *** 
#   *   * 
#   *   * 
#   ***** 
#   *   * 
#   *   * 
#   *   * 