# Beginner level

# 1. Напишіть функцію, яка отримує ім’я і друкує вітальне повідомлення Hello, <name>.

# name = input("Enter name: ")

# def name_hello (name):
#     return f"Hello, {name}!"

# print(name_hello(name))

#------------------------------------------------------------------------------------------

# 2. Напишіть функцію, яка отримує рядок і ціле число n та повертає n копій заданого рядка.

# def copy_string(text, n):
#     return (" " + text + " ") * n

# text = input("Enter text: ")
# n = int(input("Enter number: "))

# print(copy_string(text, n))

#------------------------------------------------------------------------------------------

# 3. Напишіть функцію для обчислення суми двох цілих чисел.

# def summa (a,b):
#     return a + b

# n1 = int(input("Enter number1: "))
# n2 = int(input("Enter number2: "))

# print("Summa", summa(n1,n2))

#------------------------------------------------------------------------------------------

# 4. Напишіть функцію для отримання рядка з перших n символів іншого рядка. Якщо довжина рядка менше n, поверніть початковий рядок.

# def n_letter (text, n):
#     if len(text) < n:
#         return text
#     return text[:n]

# text = input("Enter text: ")
# n = int(input("Enter number: "))

# print(n_letter(text, n))

#------------------------------------------------------------------------------------------

# 5. Напишіть функцію для визначення найбільшого з трьох цілих чисел з використанянм вбудованої функції max().

# def maximum (a, b, c):
#     return max(a, b, c)

# n1 = int(input("Enter number1: "))
# n2 = int(input("Enter number2: "))
# n3 = int(input("Enter number3: "))

# print(maximum(n1, n2, n3))

#------------------------------------------------------------------------------------------

# 6. Напишіть функцію для створення позначок тегів HTML навколо введених рядків. Функція отримує назву тега HTML і рядок, який необхідно помістити у відповідні теги.

# def teg_html (teg, text):
#     return f"<{teg}>{text}</{teg}>"


# text = input("Enter text: ")

# # teg, string = text.split()

# teg = text.split()[0]
# string = " ".join(text.split()[1:])

# print(teg_html(teg, string))

#------------------------------------------------------------------------------------------

# 7. Напишіть функцію, яка повертає назву пори року для введеного значення номера місяця.

# def season (month):

#     while month >= 1 and month <= 12:
        
#         if month == 12 or month == 1 or month ==2:
#             return "Winter"
        
#         elif month >= 3 and month <=5:
#             return "Spring"
        
#         elif month >= 6 and month <=8:
#          return "Summer"
        
#         return "Autumn"

# n = int(input("Enter number of month: "))

# print(season(n))

#------------------------------------------------------------------------------------------

# 8. Напишіть функцію для створення гістограми (наприклад, у вигляді *) із заданого списку цілих чисел як у вихідних даних. Формат введення списку чисел як у вхідних даних.


# def histogram (list):
   
#    for i in list:
#       print("*" * i)
      
# list = [2,7,1,4,2,3,9,3]

# histogram (list)

#------------------------------------------------------------------------------------------

# Middle level

# 9. Напишіть функцію для визначення, чи рік високосний чи ні.
# Рік є високосним, якщо виконується одна з умов:
# Ділиться на 400
# Ділиться на 4, але не ділиться на 100


# def leap_year(year):

#     if (year % 400 == 0) or (year % 4 == 0 and year % 100 != 0):
#         return True
#     else:
#         return False

# year = int(input("Enter year: "))

# if leap_year(year):
#     print("Високосний рік")
# else:
#     print("Невисокосний рік")

#------------------------------------------------------------------------------------------

# 10. Напишіть функцію, яка отримує значення середньомісячної кількості опадів по місяцях (в мм) і повертає загальний обсяг опадів протягом року, середньорічну кількість опадів, назви місяців та значення з найвищим та найменшим числом опадів протягом року.

# def rainfall_statistics(values):
    
#     months = [
#         "January", "February", "March", "April", "May", "June", "July", "August", "September", "October", "November", "December"
#         ]
    
#     rain = list(map(float, values.split()))

#     total = sum(rain)

#     average = total / len(rain)

#     max_rain = max(rain)
#     min_rain = min(rain)

#     max_month = months[rain.index(max_rain)]
#     min_month = months[rain.index(min_rain)]

#     return (total, average, (max_rain, max_month), (min_rain, min_month))


# data = "22 22 24 49 72 98 101 82 51 40 36 24"

# result = rainfall_statistics(data)

# print(result)

#------------------------------------------------------------------------------------------

# 11. На стадіоні є три категорії місць для сидіння: місця класу A коштують a грошових одиниць, місця класу B коштують b грошових одиниць, а місця класу C - c грошових одиниць. Напишіть першу функцію, яка запитує скільки продано квитків на кожний клас місць, і другу функцію, яка відображає суму отриманого доходу від продажу квитків на кожен клас окремо і загалом. Формати введення і виведення такі, як у вхідних і вихідних даних.


def get_ticket_data():
    tickets = {}
    for _ in range(3): # "_" це символ який можна використовувати замість змінної циклу, коли цикл лише для кількості повторювань, без підстановки значень змінної "i"
        category = input("category: ").strip()  # sprip прибирає пробіли на початку і у кінці
        price = float(input("price: ").strip())
        sold = int(input("sold: ").strip())
        tickets[category] = (price, sold)
    
    return tickets

# print(get_ticket_data())

def calculate_revenue(tickets):
    tickets_by_class = {}
    total = 0
    # category, (price, sold) = ('f': (5.0, 6))
    # category = 'f', price = 5.0, sold = 6
    for category, (price, sold) in tickets.items():
        revenue = price * sold
        tickets_by_class[category] = revenue
        total += revenue

    return tickets_by_class, total

print(calculate_revenue(get_ticket_data()))

# data = get_ticket_data()
# res = calculate_revenue(data)
# print(res)

# Вхідні дані:

# A
# 20.50
# 45
# B
# 15.75
# 30
# C
# 10.55
# 15
# Вихідні дані:

# ({'A': 922.5, 'B': 472.5, 'C': 158.25}, 1553.25)

#------------------------------------------------------------------------------------------

# 12. Напишіть функцію, яка перевіряє, чи рядок є паліндром чи ні. Регістр літер, пропуски і знаки пунктуації не враховувати.
# Паліндром - це слово, фраза або послідовність, яка читається так само як зліва направо, так і справа наліво.


#------------------------------------------------------------------------------------------

# Рекурсивна функція

# def countdown(n):
#     if n == 0:
#         print("Start!")
#     else:
#         print(n)
#         countdown(n - 1)

# countdown(5)

#------------

# def countdown(n):
#     if n > 0:
#         print(n)
#         countdown(n - 1)
    
#     return "Start!"
    
# print(countdown(5))

#--------------------

# def factorial(n):
#     if n == 1:
#         return 1
#     return n * factorial(n - 1)

# print(factorial(5))   

#-----------------------

# def sum_numbers(a, b):
#     return a + b

# def sqr(a,b):
#     return sum_numbers(a, b) ** 2

# print(sqr(2,7))

#----------------

# def add_number(a, b):
#     if b == 0:
#         return a
#     return helper(a + 1, b - 1)

# def helper(a, b):
#     if b == 0:
#         return a
#     return add_number(a + 1, b - 1)

# print(add_number(5, 4))

# Hard level

# 13. Напишіть рекурсивну функцію, яка обчислює суму цілих чисел a і b. З арифметичних операцій використовується тільки додавання одиниці і віднімання одиниці.

def task13():

    def add_number(a, b):
        if b == 0:
            return a
        elif b > 0:
            return add_number(a + 1, b - 1)
        else:
            return add_number(a - 1, b + 1)
        
    print(add_number(5, 3))

# task13()

# 14. Дано послідовність цілих чисел, що закінчується числом 0. Напишіть рекурсивну функцію, яка друкує цю послідовність в зворотному порядку. При розв’язуванні цього завдання не можна користуватися списками.

# while True:
#     n = int(input("Enter number: "))
#     if n == 0:
#         break

def task14():

    def print_number():
        
        n = int(input("Enter number: "))
        if n == 0:
            return
        else:
            print_number()
        
        print(n)

    print_number()

# task14()  

# def print_number_str():
        
#         n = int(input("Enter number: "))
#         if n == 0:
#             return
#         else:
#             print_number_str()
#         print(int(n[n.rfind(" ")+1:])

# print_number_str()

# print("1 33 72".rfind(" "))
# print("1 33 72"[:"1 33 72".rfind(" ")+1:])

# def recurs_reverse(num):
#     if num == "".join(num.split(" ")):
#         return print(num)
#     else:
#         print(num[num.rfind(" ") + 1:], end=" ")
#         return recurs_reverse(num[:num.rfind(" ")])
# recurs_reverse("12 11 12 3 55 1 1 5 0")

# 15. У кожної кредитної картки є номер, який надрукований на ній, а також інший номер, вбудований у магнітну стрічку із зворотного боку картки. Цей номер також зберігається у певній базі даних для того, щоб коли вашою карткою розраховуються за покупку, банк знав, з якого рахунку cписувати гроші. У світі багато людей з кредитними картками, і тому ці номери доволі великі: American Express використовує номери із 15 розрядів, MasterCard - з 16, Visa - з 13 або 16. Ці розряди - десяткові (від 0 до 9). Номери кредитних карт мають певну структуру. Номери карток American Express починаються з 34 чи 37; номери карт MasterCard починаються з 51, 52, 53, 54 чи 55 (формально, вони можуть починатись і з деяких інших чисел, але ми не звертатимемо на це уваги в межах нашої задачі); номери карт Visa починаються з 4. Також номери карт мають вбудовану у них контрольну суму, що обраховується за допомогою математичної формули. Тож яка це секретна формула? Більшість карток використовують алгоритм, створений Гансом Петером Луном з IBM (Алгоритм Луна ). Відповідно до цього алгоритму, ви можете перевірити, чи номер кредитної картки є синтаксично коректним, наступним чином. Рядки довжиною 1 або менше не є дійсними. Пропуски дозволені для введення, але їх необхідно видалити перед перевіркою. Усі інші нецифрові символи заборонені.

# Приклад 1: дійсний номер кредитної картки
# 4539 1488 0343 6467
# Перший крок алгоритму Луна - це подвоєння кожної другої цифри, починаючи справа:
# 4_3_ 1_8_ 0_4_ 6_6_
# Якщо подвоєння числа є числом, що перевищує 9, необхідно відняти 9 від добутку.
# Результати нашого подвоєння, розставлені на свої місця:
# 8569 2478 0383 3437
# Далі необхідно підсумувати всі цифри:
# 8+5+6+9+2+4+7+8+0+3+8+3+3+4+3+7 = 80
# Якщо сума націло ділиться на 10, то число дійсне. Цей номер дійсний!  



# Приклад 2: недійсний номер кредитної картки
# 8273 1232 7352 0569
# Подвоєння кожної другої цифри, починаючи справа
# 7253 2262 5312 0539
# Сума цифр
# 7+2+5+3+2+2+6+2+5+3+1+2+0+5+3+9 = 57
# 57 націло не ділиться на 10, тому це число недійсне.  


# Напишіть функцію(ї) для валідації номера кредитної картки за алгоритмом Луна і виведення приналежності картки для трьох компаній (American Express, MasterCard, Visa) як у вихідних даних. У разі некоректності номера або невідповідності переліченим компаніям, вивести повідомлення INVALID.