# Сума двох чисел: Написати програму, яка зчитує два цілих числа та виводить їх суму.

# n1 = int(input('Введіть перше число: '))
# n2 = int(input('Введіть друге число: '))
# print('Сума двох чисел: ' + str(n1 + n2))

# -------------------------------------------------------------------------------------

# Гіпотенуза: За двома катетами прямокутного трикутника знайти довжину його гіпотенузи.

# k1 = float(input('Введіть перший катет: '))
# k2 = float(input('Введіть другий катет: '))
# print('Гіпотенуза:', (k1 ** 2 + k2 ** 2) ** 0.5)

# -------------------------------------------------------------------------------------

# Двічі: Написати програму, яка зчитує ціле число та виводить його двічі.

# n = str(int(input('Введіть число: ')))
# print(n * 2)

# -------------------------------------------------------------------------------------

# Привіт, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить привітання.

# name = input("Введіть своє ім'я: ")
# print('Привіт, ' + name + '!')

# -------------------------------------------------------------------------------------

# Прощавай, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить прощання.

# name = input("Введіть своє ім'я: ")
# print('Прощавай, ' + name + '!')

# -------------------------------------------------------------------------------------

# Вік через рік: Напишіть програму, яка запитує ім'я користувача та його вік. Потім виведіть повідомлення, яке повідомляє, скільки йому буде років через рік.

# name = input("Введіть своє ім'я: ")
# age = int(input('Введіть свій вік: '))
# print(name + ', ваш вік через рік:', age + 1)

# -------------------------------------------------------------------------------------

# Площа прямокутника: Напишіть програму, яка запитує довжину та ширину прямокутника, а потім обчислює та виводить його площу.

# length = float(input('Введіть довжину прямокутника: '))
# width = float(input('Введіть ширину прямокутника: '))
# area = length * width
# print ('Площа прямокутника:', area)

# -------------------------------------------------------------------------------------

# Конвертер валют: Запропонуйте користувачеві ввести суму в одній валюті (наприклад, доларах), а потім виведіть цю суму в іншій валюті (наприклад, євро), використовуючи заздалегідь визначений коефіцієнт обміну.

# exchange_rate = 0.863
# currency_usd = float(input('Введіть суму в $: '))
# print ('Сума в евро:', currency_usd * exchange_rate)

# -------------------------------------------------------------------------------------

# Вартість покупки: Запитайте користувача назву товару, його ціну та кількість. Обчисліть загальну вартість покупки та виведіть її на екран.

# product = input('Введіть назву продукту: ')
# price = float(input('Введіть ціну продукту: '))
# quantity = int(input('Введіть к-ть: '))
# print ('Сума покупки:', price * quantity)

# -------------------------------------------------------------------------------------

# Температура: Напишіть програму, яка перетворює температуру з градусів Цельсія на Фаренгейт. Запитайте користувача температуру в градусах Цельсія.

# celsius = float(input('Введіть температуру у °C: '))
# fahrenheit = celsius * 9/5 + 32
# print('Температура у °F:', fahrenheit)