# Задания к уроку по теме «set() | dict()»

# МНОЖИНА
# new_set = set()      НЕМАЄ ПОВТОРІВ
# new_set2 = {1, 5, 2} МОЖЕМО ЗМІНЮВАТИ
# a.add(4) - додати елемент
# s.discard(5) - означає «видалити елемент 5 із множини», якщо він там є. Якщо такого елемента немає, помилки не буде.
# s.remove(5) - Якщо 5 немає в множині, програма викине помилку: KeyError: 5
# Метод .get(key, default) шукає ключ у словнику:
# Якщо ключ є → повертає його значення.
# Якщо ключа немає → повертає те, що ти вкажеш після коми (значення за замовчуванням).

#СЛОВНИК
# new_dict = {}
# new_dict2 = {"key": "value", "key2": "value2"}


# Beginner level

# 1. Створіть словник зі списками добрих справ на сьогодні і на завтра. Надрукуйте із словника добрі справи, які плануєш зробити сьогодні і взавтра.

def task1():

    to_do = {
        "today": ["read", "clear", "dog"],
        "tomorrow": ["read", "call my mom"]
    }
    
    print("To do for today:")
    for item in to_do["today"]:
        print("-", item)

    print("To do for tomorrow:")
    for item in to_do["tomorrow"]:
        print("-", item)

# task1()

# 2. Припустимо, що у нас є словник, в якому ключі є ідентифікаторами, а значення – іменами користувачів. Напишіть програму, яка виводить вітальне повідомлення користувачу на основі його ідентифікатора. Якщо ідентифікатор відсутній у словнику, виводиться вітання для усіх користувачів.

def task2():

    users = {
        0: "Alice",
        1: "Bob",
        2: "Jack"
    }

    user_id = int(input("Your id: "))

    if user_id in users:
        print(f"Hello, {users[user_id]}!")
    else:
        print("Hi, to all!")

# task2()

# Вхідні дані:

# 232
# 550
# 190
# 500

# Вихідні дані:
# Hi, Alice!
# Hi, Bob!
# Hi, Jack!
# Hi, to all!


# 3. Напишіть програму для сортування за зростанням (за алфавітом) словника за ключами. Словник зберігає пари ключ-значення у вигляді «назва фільму: рік релізу». Інформація виводиться як у вихідних даних: сортування має бути проведено за назвами фільмів.

def task3():

    films = {
        'Iron Man': 2008,
        'Avengers: Endgame': 2019,
        'Thor': 2011,
        'Guardians of the Galaxy': 2014
    }

    sorted_films = dict(sorted(films.items()))

    # for name, year in sorted_films.items():
    #     print(f"('{name}: {year})")

    for name_year in sorted_films.items():
        print(name_year)

# task3()

# Вихідні дані:
# ('Avengers: Endgame', 2019) ('Guardians of the Galaxy', 2014) ('Iron Man', 2008) ('Thor', 2011)

# 4. Надрукуйте елементи словника, де ключі - це числа від '1' до 'n' (обидва числа включно), а значення - квадрати ключів. 'n' – ціле число, яке вводить користувач.

def task4():

    n = int(input("n: "))
    # squares = {} # dict()

    # for i in range(1, n+1):
    #     squares[i] = i ** 2 # dict[key] = value
    
    squares = {i: i ** 2 for i in range(1, n+1)}
    
    print(squares)

# task4()


# 5. Створіть словник, в кому ключі – назви днів тижня, а значення - цілі числа, що позначають порядковий номер дня тижня від 0 до 6. Надрукуйте назву дня за введеним порядковим номером дня. Якщо введений номер виходить за межі, програма жодних повідомлень не друкує і не повідомляє про помилку.

def task5():

    weeks = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]

    days = [i for i in range(7)]

    #-----------------1
    # week_dict = {}
    # for day in range(7):
    #     week_dict[weeks[day]] = days[day]

    #------------------2
    # week_dict = {weeks[day]: days[day] for day in range(7)}

    #------------------3

    # zip(keys, values)
    #списки ключів та значень повинні співпадати за розміром!!
    week_dict = dict(zip(weeks, days))
    
    # print(week_dict)

    n = int(input("Enter n: "))

    for day, number in  week_dict.items():
        if number == n:
            print(day)
            break

# task5()

# 6. Напишіть програму для створення словника із введеного рядка символів для підрахунку кількості символів.

def task6():

    # Створюємо змінну text і записуємо в неї рядок
    text = "Lorem ipsum dolor sit amet"

    # Перетворюємо рядок у список символів
    # Кожна літера, пробіл або знак стає окремим елементом списку
    text = list(text)

    # Створюємо словник letters за допомогою генератора словників
    # Проходимося по кожному символу i в списку text
    # Для кожного символу рахуємо, скільки разів він зустрічається у списку text (text.count(i))
    # Ключем буде сам символ, а значенням — кількість його повторень
    letters = {i: text.count(i) for i in text}

    # Виводимо отриманий словник на екран
    # Наприклад: {'L': 1, 'o': 3, 'r': 2, 'e': 2, ...}
    print(letters)

# task6()

# Вхідні дані:

# Lorem ipsum dolor sit amet
# Вихідні дані:

# {'L': 1, 'o': 3, 'r': 2, 'e': 2, 'm': 3, ' ': 4, 'i': 2, 'p': 1, 's': 2, 'u': 1, 'd': 1, 'l': 1, 't': 2, 'a': 1}


# 7. Напишіть програму, яка приймає рядок символів, і обчислює кількість букв і цифр.

def task7():

    text = "Project Gutenberg offers over 59,000 free eBooks"

    number_count = 0
    alpha_count = 0

    for el in text:

        if el.isdigit():
            number_count += 1
        elif el.isalpha():
            alpha_count += 1

    result = { 
        "LETTERS ": alpha_count,
        "DIGITS": number_count
    }

    # print(result)

    for key, value in result.items():
        print(key, value)

# task7()

# Вхідні дані:

# Project Gutenberg offers over 59,000 free eBooks
# Вихідні дані:

# LETTERS 36
# DIGITS 5



# Middle level

# 8. Напишіть програму для видалення дублікатів зі списку цілих чисел.

def task8():

    numbers = [1, 5, 3, 8, 0, 1, 5, 3, 4]
    print(set(numbers))

# task8()   

# 9. Дано список словників. Кожен словники має 2 пари елементів: ключ 'name' і значення імені студента, ключ 'points' і значення - список балів з різних дисциплін (цілі двоцифрові числа). Надрукуйте найменші значення балів, отримані кожним студентом, в один рядок з пропуском.

def task9():

    stidents = [
        {"name": "Bob", "points":[12, 10, 11]},
        {"name": "Alisa", "points":[11, 11, 12]},
        {"name": "Garry", "points":[11, 12, 10]}
    ]

    for item in stidents:
            print(item["name"], min(item["points"]))

# task9()


# 10. Дано два списки чисел. Порахуйте, скільки унікальних цифр міститься в обох з них.

def task10():

    numbers1 = [1, 5, 3, 8, 0, 1]
    numbers2 = [23, 9, 0, 1, 5]

    numbers1 = set(numbers1)
    numbers2 = set(numbers2)

    # res = len(set(numbers1 + numbers2))
    # print(res)

    print(numbers1.symmetric_difference(numbers2))
    print(numbers1 ^ numbers2)

# task10()

#-------------------------------------------------------------

# numbers1 = {1, 5, 3, 8, 0}
# numbers2 = {23, 9, 0, 1, 5}

# 1. Об’єднання множин (union або |)
# об’єднує елементи з обох множин, без повторів.
# Результат: {0, 1, 3, 5, 8, 9, 23}

# print(numbers1.union(numbers2)) # a | b
# print(numbers1 | numbers2)

# 2. Різниця множин (difference або -)
# показує, які елементи є в numbers1, але немає в numbers2
# Результат: {3, 8}

# print(numbers1.difference(numbers2))
# print(numbers1 - numbers2)

# 3. Симетрична різниця (symmetric_difference або ^)
# об’єднання обох множин мінус спільні елементи.
# Тобто залишає тільки ті, що є або в одній, або в іншій, але не в обох.
# Результат: {3, 8, 9, 23}

# print(numbers1.symmetric_difference(numbers2))
# print(numbers1 ^ numbers2)

# 4. Перетин множин (intersection або &)
# показує елементи, які є в обох множинах одночасно.
# Результат: {0, 1, 5}

# print(numbers1.intersection(numbers2))
# print(numbers1 & numbers2)

# ---------------------------------------------------------------

# 11. Дано три словники, в яких ключами є малі букви латинського алфавіту, а значеннями - цілі числа. Ключі у всіх словниках – різні, їх є по 3 в кожному словнику. Об’єднайте всі три словники в один і виведіть його вміст. Підказка. скористайтеся оператором **, що використовується для об’єднання довільної кількості словників.

# 12. Створіть словник, який відображає ідентифікатори акцій на біржі. Ключами словника є ідентифікатори акцій, а значеннями - дійсні числа - ціни акцій. Надрукуйте ціни акцій та ідентифікатори у порядку зростання ціни.

# Вихідні дані:

# 10.75 FB
# 37.2 HPQ
# 45.23 ACME
# 205.55 IBM
# 612.78 AAPL


# 13. В рядку записаний текст. Словом вважається послідовність непробільних символів, які йдуть підряд, слова розділені одним або більшим числом пропуском або символами кінця рядка. Для кожного слова з цього тексту підрахуйте, скільки разів воно зустрічалося в цьому тексті раніше.

# Вхідні дані:

# var list set tuple list tuple tuple dict var
# Вихідні дані:

# 0 0 0 0 1 1 2 0 1


# Hard level

# 14. Напишіть програму, яка зможе підрахувати слова у введеному рядку, розділені пропуском і вивести отриману статистику: для кожного унікального слова обчислити число його повторень (без урахування регістру), слова не повинні повторюватися, порядок слів довільний.

# Вхідні дані:

# a bb acD bb abc ac BCD a
# Вихідні дані:

# a 2
# bb 2
# acd 1
# abc 1
# ac 1
# bcd 1

# 15. Дано два списки чисел. Знайдіть всі числа, що зустрічаються як в першому, так і другому списках, і надрукуйте їх у порядку зростання.

# Вхідні дані:

# 2 5 8 11 10 9
# 11 3 7 6 8 5
# Вихідні дані:

# 5 8 11

# 16. Напишіть програму, яка вміє шифрувати і розшифровувати використовуючи шифр підстановки. Програма приймає на вхід два рядки однакової довжини, у першому рядку записані символи початкового алфавіту, у другому рядку - символи кінцевого алфавіту (шифр підстановки), після чого йде рядок, який потрібно зашифрувати переданим шифром підстановки, і ще один рядок, який потрібно розшифрувати. Нехай, наприклад, на вхід програми передано:
# abcd
# *d%#
# abacabadaba
# #*%*d*%
# Це означає, що символ a вхідного повідомлення замінюється на символ * в шифрі, b замінюється на d, c - на % і d - на #. Потрібно зашифрувати рядок abacabadaba і розшифрувати рядок #*%*d*% за допомогою цього шифру. Отримуємо наступні рядки, які і передаємо на виведення програми:
# *d*%*d*#*d*
# dacabac
# Вхідні дані:
# abcd
# 1234
# ababcdcd
# 44332211
# Вихідні дані:
# 12123434
# ddccbbaa


