# Домашнє завдання:

# Задача 1. Середнє трьох чисел
# Користувач вводить три числа. Обчисли середнє арифметичне.

# n1 = float(input('Enter number1: '))
# n2 = float(input('Enter number2: '))
# n3 = float(input('Enter number3: '))
# print('Average:', (n1 + n2 + n3) / 3)
# ----------------------------------------------------------------------------

# Задача 2. Остача від ділення
# Користувач вводить два числа. Знайди остачу від ділення першого на друге.

# n1 = float(input('Enter number1: '))
# n2 = float(input('Enter number2: '))
# print('Remainder from divisione:', int(n1 % n2))
# ----------------------------------------------------------------------------

# Задача 3. Подвоєне число
# Користувач вводить число. Виведи подвоєне значення цього числа.

# n = float(input('Enter number: '))
# print('Double:', n * 2)
# ----------------------------------------------------------------------------

# Задача 4. Конвертація хвилин у секунди
# Користувач вводить кількість хвилин. Обчисли, скільки це буде секунд.

# minutes = float(input('Enter minutes: '))
# seconds = minutes * 60
# print('Seconds:', seconds)
# ----------------------------------------------------------------------------

# Задача 5. Кількість яблук на кожного
# Є n яблук і k учнів. Скільки яблук отримає кожен учень, якщо ділити порівну, і скільки залишиться?

# n = int(input('Enter the number of apples: '))
# k = int(input('Enter the number of students: '))
# quantity = n // k     
# remainder = n % k      
# print('Each student receives', quantity, 'apples')
# print('Remaining apples:', remainder)
# ----------------------------------------------------------------------------

# Задача 6. Остання цифра числа
# Користувач вводить число. Виведи його останню цифру.

# number = int(input('Enter number: '))
# last_number = number % 10
# print('last number:', last_number)

# ----------------------------------------------------------------------------

# Задача 7*. Обмін змінних
# Користувач вводить два числа. Після цього потрібно “поміняти” їх місцями і вивести результат.

# n1 = int(input('Enter number1: '))
# n2 = int(input('Enter number2: '))
# n1, n2 = n2, n1
# print ('number1:',n1,'number2:', n2)